Revit 2015 API
SelElementSet.Clear Method
Clear the selected element set.
Namespace: Autodesk.Revit.UI.Selection
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public override void Clear()
Visual Basic
Public Overrides Sub Clear
Visual C++
public:
virtual void Clear() override
Remarks
All the elements in the selected element set will be removed and no element will be highlighted after the operation.
See Also
SelElementSet Class
Autodesk.Revit.UI.Selection Namespace